function autocomplete(inp, arr) {
    /*функция автозаполнения принимает два аргумента,
      элемент текстового поля и массив возможных значений автозаполнения:*/
    var currentFocus;
    /*выполните функцию, когда кто-то пишет в текстовом поле:*/
    inp.addEventListener("input", function (e) {
        var a, b, i, val = this.value;
        /*закройте все уже открытые списки значений автозаполнения*/
        closeAllLists();
        if (!val) { return false; }
        currentFocus = -1;
        /*создайте элемент DIV, который будет содержать элементы (значения):*/
        a = document.createElement("DIV");
        a.setAttribute("id", this.id + "autocomplete-list");
        a.setAttribute("class", "autocomplete-items");
        /*добавьте элемент DIV в качестве дочернего элемента контейнера автозаполнения:*/
        this.parentNode.appendChild(a);
        /*для каждого элемента массива...*/
        for (i = 0; i < arr.length; i++) {
            /*проверьте, начинается ли элемент с тех же букв, что и значение текстового поля:*/
            if (arr[i].substr(0, val.length).toUpperCase() == val.toUpperCase()) {
                /*создайте элемент DIV для каждого соответствующего элемента:*/
                b = document.createElement("DIV");
                /*сделайте соответствующие буквы жирными:*/
                b.innerHTML = "<strong>" + arr[i].substr(0, val.length) + "</strong>";
                b.innerHTML += arr[i].substr(val.length);
                /*вставьте поле ввода, которое будет содержать значение текущего элемента массива:*/
                b.innerHTML += "<input type='hidden' value='" + arr[i] + "'>";
                /*выполните функцию, когда кто-то нажимает на значение элемента (DIV элемент):*/
                b.addEventListener("click", function (e) {
                    /*вставьте значение для текстового поля автозаполнения:*/
                    inp.value = this.getElementsByTagName("input")[0].value;
                    /*закройте список значений автозаполнения,
                    (или любые другие открытые списки значений автозаполнения:*/
                    closeAllLists();
                });
                a.appendChild(b);
            }
        }
    });
    /*выполнение функции нажатие клавиши на клавиатуре:*/
    inp.addEventListener("keydown", function (e) {
        var x = document.getElementById(this.id + "autocomplete-list");
        if (x) x = x.getElementsByTagName("div");
        if (e.keyCode == 40) {
            /*Если нажата клавиша со стрелкой вниз,
              увеличьте текущую переменную фокуса:*/
            currentFocus++;
            /*и сделать текущий элемент более заметным:*/
            addActive(x);
        } else if (e.keyCode == 38) { //вверх
            /*Если нажата клавиша со стрелкой вверх,
              уменьшите текущую переменную фокуса:*/
            currentFocus--;
            /*и сделать текущий элемент более заметным:*/
            addActive(x);
        } else if (e.keyCode == 13) {
            /*Если нажата клавиша ENTER, не допускайте отправки формы,*/
            e.preventDefault();
            if (currentFocus > -1) {
                /*и имитировать щелчок по "активному" пункту:*/
                if (x) x[currentFocus].click();
            }
        }
    });
    function addActive(x) {
        /*функция для классификации элемента как " активного":*/
        if (!x) return false;
        /*начните с удаления "активного" класса на всех элементах:*/
        removeActive(x);
        if (currentFocus >= x.length) currentFocus = 0;
        if (currentFocus < 0) currentFocus = (x.length - 1);
        /*добавить класс "autocomplete-active":*/
        x[currentFocus].classList.add("autocomplete-active");
    }
    function removeActive(x) {
        /*функция для удаления класса "active" из всех элементов автозаполнения:*/
        for (var i = 0; i < x.length; i++) {
            x[i].classList.remove("autocomplete-active");
        }
    }
    function closeAllLists(elmnt) {
        /*закройте все списки автозаполнения в документе,
        за исключением того, что было передано в качестве аргумента:*/
        var x = document.getElementsByClassName("autocomplete-items");
        for (var i = 0; i < x.length; i++) {
            if (elmnt != x[i] && elmnt != inp) {
                x[i].parentNode.removeChild(x[i]);
            }
        }
    }
    /*выполните функцию, когда кто-то щелкает в документе:*/
    document.addEventListener("click", function (e) {
        closeAllLists(e.target);
    });
}


var countries = [
    "Абакан",
    "Азов",
    "Александров",
    "Алексин",
    "Альметьевск",
    "Анапа",
    "Ангарск",
    "Анжеро-Судженск",
    "Апатиты",
    "Арзамас",
    "Армавир",
    "Арсеньев",
    "Артем",
    "Архангельск",
    "Асбест",
    "Астрахань",
    "Ачинск",
    "Балаково",
    "Балахна",
    "Балашиха",
    "Балашов",
    "Барнаул",
    "Батайск",
    "Белгород",
    "Белебей",
    "Белово",
    "Белогорск (Амурская область)",
    "Белорецк",
    "Белореченск",
    "Бердск",
    "Березники",
    "Березовский (Свердловская область)",
    "Бийск",
    "Биробиджан",
    "Благовещенск (Амурская область)",
    "Бор",
    "Борисоглебск",
    "Боровичи",
    "Братск",
    "Брянск",
    "Бугульма",
    "Буденновск",
    "Бузулук",
    "Буйнакск",
    "Великие Луки",
    "Великий Новгород",
    "Верхняя Пышма",
    "Видное",
    "Владивосток",
    "Владикавказ",
    "Владимир",
    "Волгоград",
    "Волгодонск",
    "Волжск",
    "Волжский",
    "Вологда",
    "Вольск",
    "Воркута",
    "Воскресенск",
    "Воткинск",
    "Всеволожск",
    "Выборг",
    "Выкса",
    "Вязьма",
    "Гатчина",
    "Геленджик",
    "Георгиевск",
    "Глазов",
    "Горно-Алтайск",
    "Грозный",
    "Губкин",
    "Гудермес",
    "Гуково",
    "Гусь-Хрустальный",
    "Дербент",
    "Дзержинск",
    "Димитровград",
    "Дмитров",
    "Долгопрудный",
    "Домодедово",
    "Донской",
    "Дубна",
    "Евпатория",
    "Егорьевск",
    "Ейск",
    "Екатеринбург",
    "Елабуга",
    "Елец",
    "Ессентуки",
    "Железногорск (Красноярский край)",
    "Железногорск (Курская область)",
    "Жигулевск",
    "Жуковский",
    "Заречный",
    "Зеленогорск",
    "Зеленодольск",
    "Златоуст",
    "Иваново",
    "Ивантеевка",
    "Ижевск",
    "Избербаш",
    "Иркутск",
    "Искитим",
    "Ишим",
    "Ишимбай",
    "Йошкар-Ола",
    "Казань",
    "Калининград",
    "Калуга",
    "Каменск-Уральский",
    "Каменск-Шахтинский",
    "Камышин",
    "Канск",
    "Каспийск",
    "Кемерово",
    "Керчь",
    "Кинешма",
    "Кириши",
    "Киров (Кировская область)",
    "Кирово-Чепецк",
    "Киселевск",
    "Кисловодск",
    "Клин",
    "Клинцы",
    "Ковров",
    "Когалым",
    "Коломна",
    "Комсомольск-на-Амуре",
    "Копейск",
    "Королев",
    "Кострома",
    "Котлас",
    "Красногорск",
    "Краснодар",
    "Краснокаменск",
    "Краснокамск",
    "Краснотурьинск",
    "Красноярск",
    "Кропоткин",
    "Крымск",
    "Кстово",
    "Кузнецк",
    "Кумертау",
    "Кунгур",
    "Курган",
    "Курск",
    "Кызыл",
    "Лабинск",
    "Лениногорск",
    "Ленинск-Кузнецкий",
    "Лесосибирск",
    "Липецк",
    "Лиски",
    "Лобня",
    "Лысьва",
    "Лыткарино",
    "Люберцы",
    "Магадан",
    "Магнитогорск",
    "Майкоп",
    "Махачкала",
    "Междуреченск",
    "Мелеуз",
    "Миасс",
    "Минеральные Воды",
    "Минусинск",
    "Михайловка",
    "Михайловск (Ставропольский край)",
    "Мичуринск",
    "Москва",
    "Мурманск",
    "Муром",
    "Мытищи",
    "Набережные Челны",
    "Назарово",
    "Назрань",
    "Нальчик",
    "Наро-Фоминск",
    "Находка",
    "Невинномысск",
    "Нерюнгри",
    "Нефтекамск",
    "Нефтеюганск",
    "Нижневартовск",
    "Нижнекамск",
    "Нижний Новгород",
    "Нижний Тагил",
    "Новоалтайск",
    "Новокузнецк",
    "Новокуйбышевск",
    "Новомосковск",
    "Новороссийск",
    "Новосибирск",
    "Новотроицк",
    "Новоуральск",
    "Новочебоксарск",
    "Новочеркасск",
    "Новошахтинск",
    "Новый Уренгой",
    "Ногинск",
    "Норильск",
    "Ноябрьск",
    "Нягань",
    "Обнинск",
    "Одинцово",
    "Озерск (Челябинская область)",
    "Октябрьский",
    "Омск",
    "Орел",
    "Оренбург",
    "Орехово-Зуево",
    "Орск",
    "Павлово",
    "Павловский Посад",
    "Пенза",
    "Первоуральск",
    "Пермь",
    "Петрозаводск",
    "Петропавловск-Камчатский",
    "Подольск",
    "Полевской",
    "Прокопьевск",
    "Прохладный",
    "Псков",
    "Пушкино",
    "Пятигорск",
    "Раменское",
    "Ревда",
    "Реутов",
    "Ржев",
    "Рославль",
    "Россошь",
    "Ростов-на-Дону",
    "Рубцовск",
    "Рыбинск",
    "Рязань",
    "Салават",
    "Сальск", ,
    "Самара",
    "Санкт-Петербург",
    "Саранск",
    "Сарапул",
    "Саратов",
    "Саров",
    "Свободный",
    "Севастополь",
    "Северодвинск",
    "Северск",
    "Сергиев Посад",
    "Серов",
    "Серпухов",
    "Сертолово",
    "Сибай",
    "Симферополь",
    "Славянск-на-Кубани",
    "Смоленск",
    "Соликамск",
    "Солнечногорск",
    "Сосновый Бор",
    "Сочи",
    "Ставрополь",
    "Старый Оскол", ,
    "Стерлитамак",
    "Ступино",
    "Сургут",
    "Сызрань",
    "Сыктывкар",
    "Таганрог",
    "Тамбов",
    "Тверь",
    "Тимашевск",
    "Тихвин",
    "Тихорецк",
    "Тобольск",
    "Тольятти",
    "Томск",
    "Троицк",
    "Туапсе",
    "Туймазы",
    "Тула",
    "Тюмень",
    "Узловая",
    "Улан-Удэ",
    "Ульяновск",
    "Урус-Мартан",
    "Усолье-Сибирское",
    "Уссурийск",
    "Усть-Илимск",
    "Уфа",
    "Ухта",
    "Феодосия",
    "Фрязино",
    "Хабаровск",
    "Ханты-Мансийск",
    "Хасавюрт",
    "Химки",
    "Чайковский",
    "Чапаевск",
    "Чебоксары",
    "Челябинск",
    "Черемхово",
    "Череповец",
    "Черкесск",
    "Черногорск",
    "Чехов",
    "Чистополь",
    "Чита",
    "Шадринск",
    "Шали",
    "Шахты",
    "Шуя",
    "Щекино",
    "Щелково",
    "Электросталь",
    "Элиста",
    "Энгельс",
    "Южно-Сахалинск",
    "Юрга",
    "Якутск",
    "Ялта",
    "Ярославль"
];


autocomplete(document.getElementById("myInput"), countries);